[
    {
        "difficulty": 3,
        "favourite_count": 77,
        "recipe_description": "The assembled lasagna should take about 50 minutes to cook in an oven preheated to 375 degrees F. Cover it with foil for the first 25 minutes, then let it cook uncovered for the final 25 minutes. Also, it's important to let the lasagna rest at room temperature for about 15 minutes before you cut into it.",
        "recipe_id": 1,
        "recipe_name": "Beef Lasagna",
        "user_id": 1
    },
    {
        "difficulty": 2,
        "favourite_count": 43,
        "recipe_description": "Let's be honest.  Chicken pasta recipes can get boring and repetitive.   Not in this recipe! Here, you sear the chicken , then mix it with vegetables, bacon, and coat it in garlic cream sauce. So good!   This chicken and bacon pasta recipe is so easy to make and uses such basic ingredients, that you can easily make it on a regular busy weeknight!\r\n\r\nThis homemade alfredo sauce perfectly combines all the flavors in this pasta dish.  So tasty, you might want to double the recipe!",
        "recipe_id": 2,
        "recipe_name": "Chicken and Bacon Penne",
        "user_id": 3
    },
    {
        "difficulty": 3,
        "favourite_count": 199,
        "recipe_description": "Nothing has expanded my horizons quite like Buying a Side of Beef. Folks, if you can find the freezer space (or a deep freezer), I cannot recommend doing this enough! It will save you money, cut down on grocery trips, and give you a new appreciation for all of the hard work that goes into bringing beef to our tables.",
        "recipe_id": 3,
        "recipe_name": "Ribeye with Mushroom Sauce",
        "user_id": 2
    },
    {
        "difficulty": 5,
        "favourite_count": 43,
        "recipe_description": "When prepared correctly, pork (especially tenderloin), is quite juicy and flavorful. We also love that pork reheats well. Some of our favorite pork recipes are baked pork tenderloin and one-pan pork chops. We love serving this mushroom stuffed pork tenderloin for special occasions.",
        "recipe_id": 4,
        "recipe_name": "Stuffed Pork Loin",
        "user_id": 5
    },
    {
        "difficulty": 4,
        "favourite_count": 11,
        "recipe_description": "This is my first salmon recipe! Salmon is probably the seafood that is most regularly cooked in our home so I cannot fathom why I am just now sharing a recipe with you! So as a consolation prize, let me share a more exquisite salmon recipe with you... pistachio-crusted salmon.\r\n",
        "recipe_id": 5,
        "recipe_name": "Pistachio crusted salmon",
        "user_id": 5
    },
    {
        "difficulty": 4,
        "favourite_count": 11,
        "recipe_description": "The layers of fried eggplant, mozzarella cheese, and parmesan baked together with a simple tomato sauce just tastes like heaven.\r\n\r\nI've been making this recipe for years now and I seriously never get bored of it.\r\n\r\nWhenever I need something comforting it is at the top of my list along with Tuscan sausage ragu, Italian Stuffed Cabbage Rolls and a good old fashioned lasagne.",
        "recipe_id": 6,
        "recipe_name": "Eggplant Parmigiana",
        "user_id": 6
    },
    {
        "difficulty": 2,
        "favourite_count": 23,
        "recipe_description": "This version of curry rice is a sort of pilaf: rice is toasted in aromatic butter before being steamed to perfection. Perfectly spiced, it makes for a solid side dish, or a filling main. Below, we break down all the components that make this rice perfect.",
        "recipe_id": 7,
        "recipe_name": "Curried Rice",
        "user_id": 5
    },
    {
        "difficulty": 4,
        "favourite_count": 87,
        "recipe_description": "Where has this honey mustard sauce been all my life?! It’s ridiculously good and the perfect topping for juicy chicken thighs. The honey mustard marinade takes less than 5 minutes to throw together and is incredibly flavorful with just a few ingredients! It goes perfectly with the baked chicken thighs. All you need is eight ingredients to make this entire dish, most of which you already have in your pantry. That’s a win in my book!",
        "recipe_id": 8,
        "recipe_name": "Honey Mustard Chicken Thighs",
        "user_id": 1
    },
    {
        "difficulty": 1,
        "favourite_count": 0,
        "recipe_description": "These incredible Peanut Butter Bars are packed with peanut butter flavor! A soft and chewy peanut butter blondie with honey and oats. This sweet and salty treat is sure to be a hit!",
        "recipe_id": 9,
        "recipe_name": "Peanut Butter Bars",
        "user_id": 5
    },
    {
        "difficulty": 2,
        "favourite_count": 53,
        "recipe_description": "Roasting cauliflower is the easiest way to turn it into a super tasty treat. Especially when you combine cauliflower with chorizo, cream, and cheese!",
        "recipe_id": 10,
        "recipe_name": "Caulfilower and Chorizo",
        "user_id": 2
    },
    {
        "difficulty": 2,
        "favourite_count": 53,
        "recipe_description": "I am just bursting with excitement! And I am so thankful for you and for the fact that you intend to grace your table with one of our recipes. \r\n\r\nMay you and your guests enjoy this Broccoli Gratin as much as my family and I did.",
        "recipe_id": 11,
        "recipe_name": "Broccoli au Gratin",
        "user_id": 2
    },
    {
        "difficulty": 3,
        "favourite_count": 76,
        "recipe_description": "Goulash is a soup or stew of meat and vegetables seasoned with paprika and other spices. Originating in Hungary, goulash is a common meal predominantly eaten in Central Europe but also in other parts of Europe. It is one of the national dishes of Hungary and a symbol of the country.",
        "recipe_id": 12,
        "recipe_name": "Slow-Cooked Beef Ghoulash",
        "user_id": 1
    },
    {
        "difficulty": 1,
        "favourite_count": 76,
        "recipe_description": "It may be pretty bold to claim, but saying this potato salad recipe is the best is a statement I’ll totally stand behind.",
        "recipe_id": 13,
        "recipe_name": "Grandma's Potato Salad",
        "user_id": 1
    },
    {
        "difficulty": 1,
        "favourite_count": 66,
        "recipe_description": "If you’ve never tried homemade Caesar Salad Dressing before, you’re in for a real treat. It is absolutely sensational, and not even the poshest gourmet store can compare to a fresh homemade one.",
        "recipe_id": 14,
        "recipe_name": "Ceaser Salad",
        "user_id": 7
    },
    {
        "difficulty": 3,
        "favourite_count": 53,
        "recipe_description": "I do a lot of grilling when the weather warms up, and I have to say, one of my favorite things to cook is these grilled pork chops. They’re packed full of flavor and pair perfectly with a variety of side dishes. These pork chops can also be broiled or pan seared in cold weather months.",
        "recipe_id": 15,
        "recipe_name": "Grilled Pork Chops",
        "user_id": 2
    },
    {
        "difficulty": 4,
        "favourite_count": 127,
        "recipe_description": "When you slow cook other cuts of slow cooking cuts of beef like chuck (like in Beef Stew), gravy beef (an Australian beef cut) and short ribs, they “fall apart easily because there is more connective tissues running throughout the meat which breakdown with slow cooking.\r\n\r\nHowever, as you can see in the photo in this post, brisket holds together and can be sliced. But the slices are ultra tender and could be shredded easily, see?",
        "recipe_id": 16,
        "recipe_name": "24Hr Beef Brisket",
        "user_id": 1
    },
    {
        "difficulty": 3,
        "favourite_count": 95,
        "recipe_description": "The salmon for this creamy salmon pasta recipe is simply seared before being flaked into the sauce. Pat skin-on salmon fillets dry with paper towels then season generously with salt and pepper! The vodka gives it that extra kick!",
        "recipe_id": 17,
        "recipe_name": "Farfelle with Salmon cream sauce",
        "user_id": 6
    },
    {
        "difficulty": 2,
        "favourite_count": 32,
        "recipe_description": "If you have leftover ribeye, then this salad is for you!",
        "recipe_id": 18,
        "recipe_name": "Beef and Parmesan Salad",
        "user_id": 7
    },
    {
        "difficulty": 4,
        "favourite_count": 87,
        "recipe_description": "You guys know how much I love my one pot meals. They’re easy, cozy, and always satisfying. This Chicken and Rice one pot meal is kind of a mash-up of two of my other favorite recipes, Cajun Sausage and Rice and Mushroom Rice, and it’s definitely moving to the top of my list of favorites. The rice is rich and flavorful, the chicken is super tender, and the whole dish comes together almost effortlessly.",
        "recipe_id": 19,
        "recipe_name": "Spiced Chicken Thighs and Rice",
        "user_id": 4
    },
    {
        "difficulty": 2,
        "favourite_count": 87,
        "recipe_description": "And here she is – my Spag Bol. Rich, thick, incredible flavour in the sauce even if you only have time for a quick 20 minute simmer. Though if you can slow cook for a couple of hours, it really takes it to another level!",
        "recipe_id": 20,
        "recipe_name": "Spaghetti Bolognese",
        "user_id": 4
    },
    {
        "difficulty": 3,
        "favourite_count": 27,
        "recipe_description": "This easy (and we mean EASY!) homemade French bread recipe is sure to be a hit! Homemade dutch oven bread that's ready in just a few hours - no overnight rise. Crispy crust on the outside and soft, airy bread on the inside! Vegetarian.",
        "recipe_id": 21,
        "recipe_name": "Crusty Bread",
        "user_id": 1
    },
    {
        "difficulty": 1,
        "favourite_count": 14,
        "recipe_description": "\r\nA great low calorie, low carb lunch or breakfast this bacon and onion omelette is perfect for if you’re on the go. With only 10 minutes to prep and cook this quick and easy meal will get you ready for the day ahead!\r\n",
        "recipe_id": 22,
        "recipe_name": "Bacon and Onion Omelette",
        "user_id": 2
    },
    {
        "difficulty": 2,
        "favourite_count": 44,
        "recipe_description": "\r\nA great low calorie, low carb lunch or breakfast this mushroom and cheese omelette is a great vegetarian alternative for when you're in a rush!\r\n",
        "recipe_id": 23,
        "recipe_name": "Mushroom and Cheese Omelette",
        "user_id": 2
    },
    {
        "difficulty": 1,
        "favourite_count": 22,
        "recipe_description": "\r\n\r\nThis easy one-pot recipe for Moroccan Spiced Vegetable Couscous is delicious on its own or makes a flavorful side dish for Oven Fried Chicken or a nice juicy steak!",
        "recipe_id": 24,
        "recipe_name": "Spiced Couscous",
        "user_id": 6
    },
    {
        "difficulty": 2,
        "favourite_count": 42,
        "recipe_description": "\r\n\r\nRoasted potatoes are a classic side dish that everyone loves. They’re crispy on the outside, soft and fluffy on the inside, and go well with just about anything. But getting them perfectly crisp can be a challenge.\r\n\r\n",
        "recipe_id": 25,
        "recipe_name": "Crispy Roast Potatoes",
        "user_id": 3
    },
    {
        "difficulty": 1,
        "favourite_count": 65,
        "recipe_description": "\r\n\r\nWe’re going back to Sicily! Pasta alla Norma is a delicious Sicilian pasta dish with eggplant, marinara and basil. I’m excited to introduce you to this dish because it is a completely satisfying vegetarian dinner.\r\n",
        "recipe_id": 26,
        "recipe_name": "Penne al Norma",
        "user_id": 3
    },
    {
        "difficulty": 2,
        "favourite_count": 108,
        "recipe_description": "\r\n\r\nSeasoned with chili powder, curry, paprika, and garlic, this savory mixture might be the best seasoning for ground beef and makes a great taco filling.\r\n",
        "recipe_id": 27,
        "recipe_name": "Spiced Beef for Tacos",
        "user_id": 4
    },
    {
        "difficulty": 1,
        "favourite_count": 54,
        "recipe_description": "\r\nIt has come to my attention that despite all the recipes I've shared on this site, I have somehow neglected to share with you my go-to recipe for this most classic of classic side dishes.\r\n",
        "recipe_id": 28,
        "recipe_name": "Mashed Potatoes",
        "user_id": 4
    },
    {
        "difficulty": 1,
        "favourite_count": 75,
        "recipe_description": "\r\nYou’ll want to put this creamy Mushroom Sauce on everything! From steak to chicken, porks chops to roasts, smothered omelettes and baked potatoes, you’re only limited by your imagination. It’s a luxurious yet simple sauce you’ll make again and again and again….\r\n",
        "recipe_id": 29,
        "recipe_name": "Mushroom Sauce",
        "user_id": 5
    },
    {
        "difficulty": 2,
        "favourite_count": 95,
        "recipe_description": "\r\nThis is the easiest, best pizza dough recipe. With just 4 ingredients and no fancy flours required, this pizza crust requires just one bowl, about 3 seconds of kneading, and just 30 minutes to rise. \r\n",
        "recipe_id": 30,
        "recipe_name": "Pizza Dough",
        "user_id": 5
    },
    {
        "difficulty": 1,
        "favourite_count": 420,
        "recipe_description": "Nuggs of the chimke",
        "recipe_id": 31,
        "recipe_name": "Chimkin Nuggs",
        "user_id": 8
    }
]